config.org
;; -*- lexical-binding: t; -*-
#+TITLE: My Emacs Configuration
#+AUTHOR: Ludovico Piero
#+EMAIL: lewdovico@gnuweeb.org
#+DATE: [2024-03-27 Wed]
#+STARTUP: showeverything
#+OPTIONS: toc:2
#+REPOSITORY: https://github.com/ludovicopiero/.emacs.d

* Table Of Content :toc:
- [[#general-packages--tweaks-to-load-before-anything][General Packages / Tweaks to Load Before Anything]]
  - [[#elpaca-package-manager][Elpaca Package Manager]]
  - [[#load-evil-mode][Load Evil Mode]]
  - [[#tweaks][Tweaks]]
- [[#all-the-icons][All The Icons]]
- [[#company][Company]]
- [[#dashboard][Dashboard]]
- [[#dired][Dired]]
- [[#diminish][Diminish]]
- [[#direnv][Direnv]]
- [[#elcord-discord-rpc][Elcord (Discord RPC)]]
- [[#flycheck][Flycheck]]
- [[#general-keybind][General Keybind]]
- [[#git-programs][Git Programs]]
  - [[#git-time-machine][Git Time Machine]]
  - [[#magit][Magit]]
- [[#ivy-counsel][Ivy (Counsel)]]
  - [[#counsel][Counsel]]
- [[#languages-support][Languages Support]]
  - [[#lsp-mode][LSP Mode]]
  - [[#nix-mode][Nix Mode]]
  - [[#web-development][Web Development]]
- [[#org-mode][Org Mode]]
  - [[#enabling-table-of-contents][Enabling Table of Contents]]
  - [[#enabling-org-bullets][Enabling Org Bullets]]
  - [[#disable-electric-indent][Disable Electric Indent]]
  - [[#diminish-org-indent-mode][Diminish Org Indent Mode]]
  - [[#source-code-block-tag-expansion][Source Code Block Tag Expansion]]
- [[#projectile][Projectile]]
- [[#rainbow-delimiters][Rainbow Delimiters]]
- [[#rainbow-mode][Rainbow Mode]]
- [[#shells-and-terminal][Shells and Terminal]]
  - [[#eshell][Eshell]]
  - [[#vterm][Vterm]]
  - [[#vterm-toggle][Vterm-toggle]]
- [[#theme][THEME]]
  - [[#all-theme][All Theme]]
  - [[#modeline][Modeline]]
- [[#treesitter][Treesitter]]
- [[#treemacs][Treemacs]]
- [[#undo-tree][Undo Tree]]
- [[#which-key][Which Key]]

* General Packages / Tweaks to Load Before Anything
** Elpaca Package Manager

   The Elpaca Package Manager facilitates package management in Emacs by providing enhanced installation and autoload generation features.

   #+begin_src emacs-lisp
   (setq elpaca-core-date '(20240221))
   (defvar elpaca-installer-version 0.7)
   (defvar elpaca-directory (expand-file-name "elpaca/" user-emacs-directory))
   (defvar elpaca-builds-directory (expand-file-name "builds/" elpaca-directory))
   (defvar elpaca-repos-directory (expand-file-name "repos/" elpaca-directory))
   (defvar elpaca-order '(elpaca :repo "https://github.com/progfolio/elpaca.git"
                                  :ref nil
                                  :depth 1
                                  :files (:defaults "elpaca-test.el" (:exclude "extensions"))
                                  :build (:not elpaca--activate-package)))
   (let* ((repo (expand-file-name "elpaca/" elpaca-repos-directory))
          (build (expand-file-name "elpaca/" elpaca-builds-directory))
          (order (cdr elpaca-order))
          (default-directory repo))
     (add-to-list 'load-path (if (file-exists-p build) build repo))
     (unless (file-exists-p repo)
       (make-directory repo t)
       (when (< emacs-major-version 28)
         (require 'subr-x))
       (condition-case-unless-debug err
           (if-let ((buffer (pop-to-buffer-same-window "*elpaca-bootstrap*"))
                    ((zerop (apply #'call-process `("git" nil ,buffer t "clone"
                                                    ,@(when-let ((depth (plist-get order :depth)))
                                                        (list (format "--depth=%d" depth) "--no-single-branch"))
                                                    ,(plist-get order :repo) ,repo))))
                    ((zerop (call-process "git" nil buffer t "checkout"
                                          (or (plist-get order :ref) "--"))))
                    (emacs (concat invocation-directory invocation-name))
                    ((zerop (call-process emacs nil buffer nil "-Q" "-L" "." "--batch"
                                          "--eval" "(byte-recompile-directory \".\" 0 'force)")))
                    ((require 'elpaca))
                    ((elpaca-generate-autoloads "elpaca" repo)))
         (progn (message "%s" (buffer-string)) (kill-buffer buffer))
         (error "%s" (with-current-buffer buffer (buffer-string))))
         ((error) (warn "%s" err) (delete-directory repo 'recursive))))
     (unless (require 'elpaca-autoloads nil t)
       (require 'elpaca)
       (elpaca-generate-autoloads "elpaca" repo)
       (load "./elpaca-autoloads")))
   (add-hook 'after-init-hook #'elpaca-process-queues)
   (elpaca `(,@elpaca-order))

   ;; Install use-package support
   (elpaca elpaca-use-package
     ;; Enable :elpaca use-package keyword.
     (elpaca-use-package-mode)
     ;; Assume :elpaca t unless otherwise specified.
     (setq elpaca-use-package-by-default t))

   ;; Block until current queue processed.
   (elpaca-wait)
   #+end_src
** Load Evil Mode

   Evil Mode provides Vim emulation in Emacs, allowing users familiar with Vim keybindings and commands to work seamlessly within Emacs.

   #+begin_src emacs-lisp
   ;; Expands to: (elpaca evil (use-package evil :demand t))
   (use-package evil
     :init
     ;; tweak evil's configuration before loading it
     (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
     (setq evil-want-keybinding nil)
     (setq evil-vsplit-window-right t)
     (setq evil-split-window-below t)
     (evil-mode))

   (use-package evil-collection
     :after evil
     :config
     ;;(setq evil-collection-mode-list '(dashboard dired ibuffer))
     (evil-collection-init))

   ;; Unmap keys in 'evil-maps if not done, (setq org-return-follows-link t) will not work
   (with-eval-after-load 'evil-maps
     ;; Unset keys in evil-motion-state-map
     (mapc (lambda (key) (define-key evil-motion-state-map (kbd key) nil))
           '("SPC" "RET" "TAB")))
   ;; Setting RETURN key in org-mode to follow links
   (setq org-return-follows-link t)
   #+end_src
** Tweaks

   This section contains various settings that don't fall into any specific category, grouped together for convenience.

   #+begin_src emacs-lisp
   ;; Enable column number mode
   (column-number-mode 1)

   ;; Automatically revert buffers when files change on disk
   (global-auto-revert-mode t)

   ;; Enable display of line numbers in buffers
   (global-display-line-numbers-mode 1)

   ;; You can select text and delete it by typing.
   (delete-selection-mode 1)

   ;; Set default indentation settings
   (setq-default indent-tabs-mode nil)
   (setq-default tab-width 2)

   ;; Configure whitespace display style
   (setq-default whitespace-style
                 '(face
                   tabs
                   spaces
                   trailing
                   lines-tail
                   newline
                   missing-newline-at-eof
                   space-before-tab
                   indentation
                   empty
                   space-after-tab
                   space-mark
                   tab-mark
                   newline-mark))

   ;; Replace yes-or-no-p with y-or-n-p
   (fset 'yes-or-no-p 'y-or-n-p)

   ;; Set backup directory and options
   (setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
         backup-by-copying      t  ; Don't de-link hard links
         version-control        t  ; Use version numbers on backups
         delete-old-versions    t  ; Automatically delete excess backups
         kept-new-versions      10 ; How many of the newest versions to keep
         kept-old-versions      5) ; How many of the old versions to keep

   ;; Disable creation of backup and autosave files
   (setq make-backup-files nil
         auto-save-default nil)

   ;; Improved handling of clipboard
   (setq select-enable-clipboard t
         select-enable-primary t
         save-interprogram-paste-before-kill t)

   ;; Disable noisy bell
   (setq visible-bell t
         ring-bell-function #'ignore)

   ;; Enable visual line mode globally
   (global-visual-line-mode t)

   ;; Show trailing whitespace
   (setq-default show-trailing-whitespace t)

   ;; Use one space to end sentences
   (setq sentence-end-double-space nil)

   ;; Prefer UTF-8 coding system
   (prefer-coding-system 'utf-8)

   ;; Enable transient mark mode for better region handling
   (transient-mark-mode 1)

   ;; Disable line numbers for specific modes
   (dolist (mode '(org-mode-hook
                   term-mode-hook
                   eshell-mode-hook))
     (add-hook mode (lambda () (display-line-numbers-mode 0))))

   ;; Enable automatic parens pairing
   (electric-pair-mode 1)

   ;; Prevent auto-pairing of <>
   (add-hook 'org-mode-hook (lambda ()
                               (setq-local electric-pair-inhibit-predicate
                                           `(lambda (c)
                                              (if (char-equal c ?<) t (,electric-pair-inhibit-predicate c))))))
   #+end_src
* All The Icons
#+begin_src emacs-lisp
(use-package all-the-icons
  :ensure t)
#+end_src
