config.org
* Company

   The "Company" section configures the Company mode, which provides auto-completion capabilities in Emacs.

   #+begin_src emacs-lisp
   (use-package company
     :defer 2
     :custom
     (company-begin-commands '(self-insert-command))
     (company-idle-delay .1)
     (company-minimum-prefix-length 2)
     (company-show-numbers t)
     (company-tooltip-align-annotations 't)
     (global-company-mode t))

   (use-package company-box
     :after company
     :hook (company-mode . company-box-mode))

   (use-package company-quickhelp
     :after company
     :config (company-quickhelp-mode))
   #+end_src
* Dashboard

   The "Dashboard" section configures the dashboard package, which provides a customizable startup screen in Emacs.

   #+begin_src emacs-lisp
   (use-package dashboard
     :ensure t
     :init
     (setq initial-buffer-choice 'dashboard-open)
     (setq dashboard-set-heading-icons t)
     (setq dashboard-set-file-icons t)
     (setq dashboard-banner-logo-title "Welcome Home!")
     ;; (setq dashboard-startup-banner 'logo) ;; use standard Emacs logo as banner
     (setq dashboard-startup-banner "~/.config/emacs/images/cry2sleep.png") ;; use custom image as banner
     (setq dashboard-center-content t)
     (setq dashboard-items '((recents . 5)
                             (agenda . 5)
                             (bookmarks . 3)
                             (projects . 3)
                             (registers . 3)))
     :custom
     (dashboard-modify-heading-icons '((recents . "file-text")
                                       (bookmarks . "book")))
     :config
     (dashboard-setup-startup-hook))
   #+end_src
* Dired

   The "Dired" section configures settings related to the Dired mode, which provides a file management interface in Emacs.

   #+begin_src emacs-lisp
   (use-package all-the-icons-dired
     :hook (dired-mode . (lambda () (all-the-icons-dired-mode t))))

   (use-package dired-open
     :config
     ;; Customize file associations for opening files in Dired
     (setq dired-open-extensions '(("gif" . "imv")
                                   ("jpg" . "imv")
                                   ("png" . "imv")
                                   ("mkv" . "mpv")
                                   ("mp4" . "mpv"))))

   (use-package peep-dired
     :after dired
     :hook (evil-normalize-keymaps . peep-dired-hook)
     :config
     ;; Customize key bindings for peep-dired
     (evil-define-key 'normal dired-mode-map (kbd "h") 'dired-up-directory)
     (evil-define-key 'normal dired-mode-map (kbd "l") 'dired-open-file) ; use dired-find-file instead if not using dired-open package
     (evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file)
     (evil-define-key 'normal peep-dired-mode-map (kbd "k") 'peep-dired-prev-file))
   #+end_src
* Diminish

   The "Diminish" section configures the diminish package, which provides a convenient way to hide or diminish minor mode indicators in the mode line.

   #+begin_src emacs-lisp
   (use-package diminish)
   #+end_src
* Direnv

   The "Direnv" section configures the direnv package, which provides integration with direnv, an environment switcher for the shell.

   #+begin_src emacs-lisp
   (use-package direnv
     :config
     ;; Enable direnv mode globally
     (direnv-mode))
   #+end_src
* Elcord (Discord RPC)

   The "Elcord" section configures the elcord package, which provides Discord Rich Presence integration for Emacs.

   #+begin_src emacs-lisp
     (use-package elcord
       :config
       (setq elcord-quiet t
             elcord-editor-icon "doom_cute_icon"
             elcord-use-major-mode-as-main-icon nil)
       (elcord-mode)

       (defun elcord--disable-elcord-if-no-frames (f)
         "Disable elcord mode if there are no frames left after deleting F from visible-frame-list."
         ;; (declare (ignore f))
         (when (let ((frames (delete f (visible-frame-list))))
                 (or (null frames)
                     (and (null (cdr frames))
                          (eq (car frames) terminal-frame))))
           (elcord-mode -1)
           (add-hook 'after-make-frame-functions 'elcord--enable-on-frame-created)))

       (defun elcord--enable-on-frame-created (f)
         "Enable elcord mode when a new frame F is created."
         ;; (declare (ignore f))
         (elcord-mode +1))

       (defun my/elcord-mode-hook ()
         "Hook to manage elcord mode activation and deactivation."
         (if elcord-mode
             (add-hook 'delete-frame-functions 'elcord--disable-elcord-if-no-frames)
           (remove-hook 'delete-frame-functions 'elcord--disable-elcord-if-no-frames)))

       (add-hook 'elcord-mode-hook 'my/elcord-mode-hook))
   #+end_src
* Flycheck

   The "Flycheck" section configures the flycheck package, which provides syntax checking for programming languages in Emacs.

   #+begin_src emacs-lisp
   (use-package flycheck
     :after lsp-mode
     :diminish flycheck-mode
     :init (global-flycheck-mode))
   #+end_src
