config.org
** Web Development

  Configures modes and settings for web development languages like HTML, CSS, JavaScript, and TypeScript.

  #+begin_src emacs-lisp
  ;; (use-package css-mode
  ;;   :mode (("\\.css\\'" . css-mode)))

  (use-package web-mode
    :mode (("\\.html\\'" . web-mode)
           ("\\.php\\'" . web-mode))
    :config
    (setq web-mode-enable-current-column-highlight t
          web-mode-enable-current-element-highlight t
          web-mode-markup-indent-offset 2
          web-mode-css-indent-offset 2
          web-mode-code-indent-offset 2))

  (use-package js-mode
    :ensure nil
    :mode (("\\.js?\\'" . js-mode)
           ("\\.jsx?\\'" . js-mode))
    :config
    (setq javascript-indent-level 2
          js-indent-level 2))

  (use-package typescript-mode
    :mode (("\\.ts?\\'" . typescript-mode)
           ("\\.tsx?\\'" . typescript-mode))
    :config
    (setq typescript-indent-level 2
          typescript-auto-indent-flag t))
  #+end_src
* Org Mode

** Enabling Table of Contents
   #+begin_src emacs-lisp
   (use-package toc-org
     :commands toc-org-enable
     :hook (org-mode . toc-org-enable))
   #+end_src

** Enabling Org Bullets
   Org-bullets give us attractive bullets rather than asterisks.
   #+begin_src emacs-lisp
   (use-package org-bullets
     :hook (org-mode . (lambda () (org-bullets-mode 1))))
   #+end_src

** Disable Electric Indent
   Org mode source blocks have some weird default indentation behavior, possibly due to `electric-indent-mode`, which is turned on by default in Emacs. Org defaults to indenting 2 spaces in source blocks. Let's turn it all off!
   #+begin_src emacs-lisp
   (add-hook 'org-mode-hook
             (lambda ()
               (electric-indent-local-mode -1)
               (setq org-edit-src-content-indentation 0)))
   #+end_src

** Diminish Org Indent Mode
   #+begin_src emacs-lisp
   (eval-after-load 'org-indent '(diminish 'org-indent-mode))
   #+end_src

** Source Code Block Tag Expansion
   #+begin_src emacs-lisp
   (require 'org-tempo)
   #+end_src
* Projectile

#+begin_src emacs-lisp
(use-package projectile
  :ensure t
  :config
  (projectile-mode 1)

  ;; Set your preferred key bindings here
  :bind (("C-c p" . projectile-command-map))

  ;; Additional settings
  :custom
  ;; Define your project root files/directories here
  (projectile-project-root-files '(".projectile" ".git" ".svn" ".hg" "Makefile" "package.json"))

  ;; Enable caching to improve performance
  (projectile-enable-caching t)

  ;; Configure indexing method (default is 'alien for faster indexing)
  (projectile-indexing-method 'alien
)

  ;; Display project name in the modeline
  (projectile-mode-line-function '(lambda () (format " Proj[%s]" (projectile-project-name)))))
#+end_src
* Rainbow Delimiters
#+begin_src emacs-lisp
(use-package rainbow-delimiters
  :hook ((emacs-lisp-mode . rainbow-delimiters-mode)
         (clojure-mode . rainbow-delimiters-mode)))
#+end_src
* Rainbow Mode

#+begin_src emacs-lisp
(use-package rainbow-mode
  :diminish
  :hook
  ((org-mode prog-mode) . rainbow-mode))
#+end_src
* Shells and Terminal

** Eshell
#+begin_src emacs-lisp
(use-package eshell-toggle
  :custom
  (eshell-toggle-size-fraction 3)
  (eshell-toggle-use-projectile-root t)
  (eshell-toggle-run-command nil)
  (eshell-toggle-init-function #'eshell-toggle-init-ansi-term))

(use-package eshell-syntax-highlighting
  :after esh-mode
  :config
  (eshell-syntax-highlighting-global-mode +1))

(setq eshell-rc-script (concat user-emacs-directory "eshell/profile")
      eshell-aliases-file (concat user-emacs-directory "eshell/aliases")
      eshell-history-size 5000
      eshell-buffer-maximum-lines 5000
      eshell-hist-ignoredups t
      eshell-scroll-to-bottom-on-input t
      eshell-destroy-buffer-when-process-dies t
      eshell-visual-commands '("bash" "fish"))
#+end_src

** Vterm
#+begin_src emacs-lisp
(use-package vterm
  :ensure t
  :after elpaca
  :config
  (setq shell-file-name "/bin/sh"
        vterm-max-scrollback 5000
        vterm-always-compile-module t))
#+end_src

** Vterm-toggle
#+begin_src emacs-lisp
(use-package vterm-toggle
  :after vterm
  :config
  (setq vterm-toggle-fullscreen-p nil)
  (setq vterm-toggle-scope 'project)
  (add-to-list 'display-buffer-alist
               '((lambda (buffer-or-name _)
                   (let ((buffer (get-buffer buffer-or-name)))
                     (with-current-buffer buffer
                       (or (equal major-mode 'vterm-mode)
                           (string-prefix-p vterm-buffer-name (buffer-name buffer))))))
                 (display-buffer-reuse-window display-buffer-at-bottom)
                 (reusable-frames . visible)
                 (window-height . 0.3))))
#+end_src

* THEME
** All Theme
   #+begin_src emacs-lisp
   (use-package doom-themes
     :ensure t
     :config
     ;; Global settings (defaults)
     (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
           doom-themes-enable-italic t) ; if nil, italics is universally disabled
     (load-theme 'doom-one t)

     ;; Enable flashing mode-line on errors
     (doom-themes-visual-bell-config)
     ;; Enable custom neotree theme (all-the-icons must be installed!)
     (doom-themes-neotree-config)
     ;; or for treemacs users
     (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
     (doom-themes-treemacs-config)
     ;; Corrects (and improves) org-mode's native fontification.
     (doom-themes-org-config))
   #+end_src

** Modeline
   #+begin_src emacs-lisp
   (use-package doom-modeline
     :ensure t
     :config
     (setq doom-modeline-minor-modes t)
     :init (doom-modeline-mode 1))
   #+end_src

* Treesitter
#+begin_src emacs-lisp
(use-package tree-sitter
  :ensure t)

(use-package tree-sitter-langs
  :after tree-sitter
  :ensure t
  :config
  (add-hook 'tree-sitter-after-on-hook #'tree-sitter-hl-mode))

(use-package tree-sitter-indentation
  :after tree-sitter
  :hook (tree-sitter-after-on . tree-sitter-indentation-mode))


(defun my/enable-tree-sitter ()
  "Enable Tree-sitter in `prog-mode'."
  (interactive)
  (require 'tree-sitter)
  (require 'tree-sitter-langs)
  (tree-sitter-mode)
  (tree-sitter-hl-mode))

(add-hook 'prog-mode-hook #'my/enable-tree-sitter)
#+end_src

* Treemacs
#+begin_src emacs-lisp
(use-package treemacs
  :ensure t
  :config
  ;; Use icons from all-the-icons package
  (setq treemacs-icons-theme 'all-the-icons)
  ;; Adjust icon size (optional)
  (treemacs-resize-icons 14))
#+end_src
* Undo Tree
#+begin_src emacs-lisp
(use-package undo-tree
  :ensure t
  :diminish
  :config
  (global-undo-tree-mode)
  (setq evil-undo-system 'undo-tree))
#+end_src
* Which Key

#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :init (which-key-mode)
    :diminish which-key-mode
    :config
    (setq which-key-idle-delay 0.3))
#+END_SRC
